/*************************************************************************
 文件功能描述:
    	MSP 43OF16x系列单片机UART程序库说明:
	该程序完成UART模块的通用程序框架，方便以后使用﹔程序主要实现了，UART模块的初始化函数，时钟的选择，波特率的设置以及IO口的设置

            使用方式:
	工程中加入UART.c文件,源文件加入对UART.h的文件包含;
*************************************************************************/
#include "msp430f169_uart.h"


/*******************************************************************************
*  函数名称：UART_Init
*  功能说明：初始化串口，设置波特率
* 入口参数：            
* 出口参数： 
*******************************************************************************/
      
void UART_Init()
{
  U0CTL|=SWRST;               //复位SWRST
  U0CTL|=CHAR;                //8位数据模式
  U0TCTL|=SSEL1;              //SMCLK为串口时钟
  U0BR1=baud_h;               //BRCLK=8MHZ,Baud=BRCLK/N
  U0BR0=baud_l;               //N=UBR+(UxMCTL)/8
  U0MCTL=0x00;                //微调寄存器为0，波特率9600bps
  ME1|=UTXE0;                 //UART1发送使能
  ME1|=URXE0;                 //UART1接收使能
  U0CTL&=~SWRST;
  IE1|=URXIE0;                //接收中断使能位

  P3SEL|= BIT4;               //设置IO口为普通I/O模式
  P3DIR|= BIT4;               //设置IO口方向为输出
  P3SEL|= BIT5;
}
/**********************************************************
* 名    称：            UART0_SendByte
* 功    能：            向串口发送字节数据，并等待发送完毕。
* 入口参数：            data              要发送的数据
* 出口参数：            无
**********************************************************/


void Send_Byte(uchar data)
{
  while((IFG1&UTXIFG0)==0);          //发送寄存器空的时候发送数据
    U0TXBUF=data;
}

//*************************************************************************
//               处理来自串口 0 的接收中断
//*************************************************************************

#pragma vector=USART0RX_VECTOR
__interrupt void UART0_RX_ISR(void)
{
  uchar data=0;
  data=U0RXBUF;                       //接收到的数据存起来
  Send_Byte(data);                    //将接收到的数据再发送出去
}

//*************************************************************************
//            处理来自串口 0 的发送中断，预留
//*************************************************************************
//
//#pragma vector=USART0TX_VECTOR
//__interrupt void UART0_TX_ISR(void)
//{
//
//}
/****************************************************************************
*函数名: SendString()                                                        
*作用  ：USART0发送字符串                                                 
*返回值：无                                                                  
*参数  ：char型指针                                                          

*****************************************************************************/
void Send_String(unsigned char *p){
  
   while(*p!='\0'){
            TXBUF0=*p++;
            while((UTCTL0&0X01)==0);//等待数据发送完毕   
          }
}




 
#endif
